/**
 * 域信息定义
 *
 * 用JSON格式定义结构会更清晰，性能更好。但为了方便整理查看各域定义信息，就定义成如下格式了。
 * 而且只需初始化一次，对性能影响很小
 *
 * 具体应用可参考此配置修改
 *
 * @type {string}
 */
const FieldDefinition = ''
	+ "2:主账号,LLVAR-N19;" // P91 该账号最多19个数字字符
	+ "3:交易处理码,N6;" //
	+ "4:交易金额,N12;" //
	+ "11:受卡方系统跟踪号,N6;" //
	+ "12:受卡方所在地时间,N6;" //
	+ "13:受卡方所在地日期,N4;" //
	+ "14:卡有效期,N4;" //
	+ "15:清算日期,N4;" //
	+ "22:服务点输入方式码,N3;" // P96
	+ "23:卡序列号,N4;" // 右靠BCD码
	+ "25:服务点条件码,N2;" // P97
	+ "26:服务点PIN获取码,N2;" // P97
	+ "32:受理机构标识码,LLVAR-N11;" // P98
	+ "35:2磁道数据,LLVAR-N99;" // P98
	+ "36:3磁道数据,LLLVAR-N104;" // P98
	+ "37:检索参考号,AN12;" //
	+ "38:授权标识应答码,AN6;" //
	+ "39:应答码,AN2;" // P99
	+ "41:受卡机终端标识码,ANS8;" // P100
	+ "42:受卡方标识码,ANS15;" // P100
	+ "43:商户名称,ANS40;"
	+ "44:附加响应数据,LLVAR-AN40;"
	+ "48:附加数据－私有,LLLVAR-N322;" // P100
	+ "49:交易货币代码,AN3;" //
	+ "52:个人标识码数据,B64;" // P103
	+ "53:安全控制信息,N16;" // P103
	+ "54:余额,LLLVAR-AN40;" // P103 LLLVAR-AN20
	+ "55:IC卡数据域,LLLVAR-AN255;" // P104
	+ "58:PBOC电子钱包标准的交易信息,LLLVAR-ANS100;" //
	+ "59:银联扫码自定义域,LLLVAR-ANS999;"
	+ "60:自定义域,LLLVAR-N999;" // P109
	+ "61:原始信息域,LLLVAR-N29;" // P112
	+ "62:自定义域,LLLVAR-ANS512;" // P112
	+ "63:自定义域,LLLVAR-ANS163;" // P127
	+ "64:MAC,B64" // P128 报文鉴别码

export default FieldDefinition